In [2]:
import os
import pandas as pd

In [3]:
# add path folder in which is the excel file with table of sample name and motifs
os.chdir(r'D:\Dropbox\Sandra Postdoc\Experiments\MotifAI\Exercises with Tehila\Output Data\Comparison Top Motifs')

In [5]:
#open excel file with pd.read_excel()
df= pd.read_excel('LIst of top motifs new and old dataset.xlsx')
df

            Sample           Motif
0     New_Ethiopia  CLVEVQATQMPFFC
1     New_Ethiopia      PSFTPFIPYS
2     New_Ethiopia      CLADPWLSDC
3     New_Ethiopia      CKPPGDITSC
4     New_Ethiopia    PIPSPQGGWLLS
...            ...             ...
1428    Old_Osorno       SCPNAPSVC
1429    Old_Osorno      ARARDLARLR
1430    Old_Osorno     PLATVPSELSS
1431    Old_Osorno     SRLWELAQLDR
1432    Old_Osorno    CEPFSASLPSFP

[1433 rows x 2 columns]

In [16]:
df['Motif'].value_counts()

CLVEVQATQMPFFC    3
LRELWYSDLMSW      2
ESDWEAVTVWTP      2
WREVILQRDS        2
KVPVDRMGNSRP      2
                 ..
CDLTVPFLISA       1
CGEWLIADSPVR      1
CTNDPWMCAC        1
CKASLLDRASYMKC    1
CLLSSRSDKCA       1
Name: Motif, Length: 1425, dtype: int64

In [25]:
df.groupby('Motif').get_group('CLVEVQATQMPFFC')

           Sample           Motif
0    New_Ethiopia  CLVEVQATQMPFFC
412    New_Osorno  CLVEVQATQMPFFC
838  Old_Ethiopia  CLVEVQATQMPFFC

In [26]:
grouped = df.groupby('Motif')['Sample']

In [28]:
list_motif=[]
list_count=[]
list_members=[]

for name, group in grouped:
    list_motif.append(name)
    list_count.append(group.count())
    list_members.append(group)
    
print(len(list_motif))
print(len(list_count))
print(len(list_members))

1425
1425
1425

In [29]:
df = pd.DataFrame(list(zip(list_motif, list_count,list_members)),
               columns =['Motif', 'Count', 'Members'])
df

             Motif  Count                                          Members
0     AAAPLHLEAPPL      1   1387    Old_Osorno
Name: Sample, dtype: object
1       AACLAMSGVC      1  831    Old_Ethiopia
Name: Sample, dtype: object
2       AADLPNLSMY      1    752    New_Osorno
Name: Sample, dtype: object
3       AAHPYSTRLQ      1    744    New_Osorno
Name: Sample, dtype: object
4      AAMPHRTGSQW      1   1384    Old_Osorno
Name: Sample, dtype: object
...            ...    ...                                              ...
1420    YTYAEREKLS      1   13    New_Ethiopia
Name: Sample, dtype: object
1421    YVDANDIIRS      1   59    New_Ethiopia
Name: Sample, dtype: object
1422   YVGTLEKPRLS      1  348    New_Ethiopia
Name: Sample, dtype: object
1423   YVSNSNVGSTL      1  915    Old_Ethiopia
Name: Sample, dtype: object
1424    YWADPGAVEN      1   1201    Old_Osorno
Name: Sample, dtype: object

[1425 rows x 3 columns]

In [33]:
def check_old(groups):
    count_old=0
    for group in groups:
        if 'Old' in group:
            count_old+=1
    return count_old

def check_new(groups):
    count_new=0
    for group in groups:
        if 'New' in group:
            count_new+=1
    return count_new   

# def check_group1(groups):
#     count_group1=0
#     for group in groups:
#         if 'Group1' in group:
#             count_group1+=1
#     return count_group1

# def check_group2(groups):
#     count_group2=0
#     for group in groups:
#         if 'Group2' in group:
#             count_group2+=1
#     return count_group2

# def check_group3(groups):
#     count_group3=0
#     for group in groups:
#         if 'Group3' in group:
#             count_group3+=1
#     return count_group3
        
        
df['new'] = df['Members'].apply(check_new) 
df['old'] = df['Members'].apply(check_old)
#df['group3'] = df['Members'].apply(check_group3)

df

,Motif,Count,Members,new,old
0,AAAPLHLEAPPL,1,"1387 Old_Osorno Name: Sample, dtype: object",0,1
1,AACLAMSGVC,1,"831 Old_Ethiopia Name: Sample, dtype: object",0,1
2,AADLPNLSMY,1,"752 New_Osorno Name: Sample, dtype: object",1,0
3,AAHPYSTRLQ,1,"744 New_Osorno Name: Sample, dtype: object",1,0
4,AAMPHRTGSQW,1,"1384 Old_Osorno Name: Sample, dtype: object",0,1
...,...,...,...,...,...
1420,YTYAEREKLS,1,"13 New_Ethiopia Name: Sample, dtype: object",1,0
1421,YVDANDIIRS,1,"59 New_Ethiopia Name: Sample, dtype: object",1,0
1422,YVGTLEKPRLS,1,"348 New_Ethiopia Name: Sample, dtype: object",1,0
1423,YVSNSNVGSTL,1,"915 Old_Ethiopia Name: Sample, dtype: object",0,1
1424,YWADPGAVEN,1,"1201 Old_Osorno Name: Sample, dtype: object",0,1

In [34]:
df.to_excel("D:\Dropbox\Sandra Postdoc\Experiments\MotifAI\Exercises with Tehila\Output Data\Comparison Top Motifs\motifs_counted.xlsx", sheet_name='Sheet_name_1')